
#include "delay.h"
#include <intrins.h>


/***************************************************************
** 函数名称: Delay1ms
** 功能描述: 延时1ms函数（不精准）
** 输　入:   
** 输　出:   
** 全局变量: 
***************************************************************/
 void Delay1ms()		//@20.000MHz
{
	unsigned char i, j;

	_nop_();
	_nop_();
	i = 20;
	j = 112;
	do
	{
		while (--j);
	} while (--i);
}




/***************************************************************
** 函数名称: Delaynms
** 功能描述: 延时nms函数（不精准）
** 输　入:   
** 输　出:   
** 全局变量: 
***************************************************************/
 void Delaynms(unsigned int n)
 {

   unsigned int i;
   for(i=0;i<n;i++) Delay1ms();

 }
