
#include "PWM.h"

/***************************************************************
** 函数名称: PWMInit
** 功能描述: PWM初始化函数
** 输　入:   
** 输　出:   
** 全局变量: 
***************************************************************/
void PWMInit()
{	
#if 0  //选择定时器0的溢出脉冲作为PWM时钟源
	CCON = 0x00;	//关闭PCA计数器，禁止计数中断，PCA模块0、1中断标志清零
	CL = 0;         //自由递增计数的16位PCA定时器的值,初始化为0
	CH = 0;
	CMOD = 0x04;	
	//选择定时器0的溢出脉冲作为PWM时钟源,空闲模式继续计数，禁止PCA计数溢出中断
  	//定时器0输出频率最高可达系统时钟，可对系统时钟进行1~256分频
	//PWM的频率=PCA时钟输入源频率/256
  	CCAP0H = CCAP0L = 0x80;	//用于控制占空比，占空比=(255-CCAPnL)/255*100%
  	CCAP1H = CCAP1L = 0x80; //初始化占空比为50%
	CCAPM0 = 0x42;	//PCA模块0设置为PWM模式：8位PWM输出，无中断
	CCAPM1 = 0x42;  //PCA模块1设置为PWM模式：8位PWM输出，无中断
  	
	CR = 1;	//PCA计数器阵列开始
#else 	//选择SYSclk作为PWM时钟源输入
	CCON = 0x00;    //关闭PCA计数器，禁止计数中断，PCA模块0、1中断标志清零
	CL = 0;         //自由递增计数的16位PCA定时器的值,初始化为0
	CH = 0;
	CMOD = 0x08;	//SYSclk作为时钟源 PWM频率为20M/256=78125Hz
  	CCAP0H = CCAP0L = 0xFF;	//用于控制占空比，占空比=(255-CCAPnL)/255*100%
  	CCAP1H = CCAP1L = 0xFF; //初始化占空比为50%
	CCAPM0 = 0x42;	//PCA模块0设置为PWM模式：8位PWM输出，无中断
	CCAPM1 = 0x42;  //PCA模块1设置为PWM模式：8位PWM输出，无中断
  	
	CR = 1;	//PCA计数器阵列开始计数
#endif
 }




