
#include "timer.h"

/***************************************************************
** 函数名称: Timer0Init
** 功能描述: 计数器0初始化函数-对外部脉冲计数
** 输　入:   
** 输　出:   
** 全局变量: 
***************************************************************/
void Timer0Init()
{

    TMOD |= 0x05;   	//定时器0用作计数器
                        //16位计数器，TL1、TH1全用
    TL0 = 0x00;		    //设置计数初值
	TH0 = 0x00;	     	//设置计数初值
    TR0 = 1;			//计数器T0开始计数
	ET0 = 1;            //允许计数器0中断 用于进位

}

/***************************************************************
** 函数名称: Timer1Init
** 功能描述: 定时器1初始化函数-采样周期10ms
** 输　入:   
** 输　出:   
** 全局变量: 
***************************************************************/
void Timer1Init(void)   //10毫秒@20.000MHz
{
	AUXR &= 0xBF;		//定时器时钟12T模式
	TMOD &= 0x0F;		//设置定时器模式
	TMOD |= 0x10;		//设置定时器模式
	TL1 = 0xE5;		    //设置定时初值
	TH1 = 0xBE;	     	//设置定时初值
	TF1 = 0;		    //清除TF1溢出标志
	TR1 = 1;		    //定时器T1开始计时
	ET1 = 1;            //允许定时器T1中断
}



